2022-2/PW/docker-code/www/codeigniter4/app/Controllers/Admin/Client.php

    public function listClients()
    {

        $ClientModel = new ClientModel();

        $data = [
            'arrayClients' => $ClientModel->findAll()
        ];
---
SELECT *
FROM `clients`

    public function insertClientAction()
    {
        $data = [
            'name' => $this->request->getVar('name'),
            'email' => $this->request->getVar('email'),
            'phone' => $this->request->getVar('phone'),
            'address' => $this->request->getVar('address'),
        ];

        $ClientModel = new ClientModel();

        $ClientModel->insert($data);
---
INSERT INTO `clients` (`name`, `email`, `phone`, `address`) VALUES ('José Cardoso', 'jose@gmail.com', '+5551987654789', 'rua das oliveiras, capão da canoa')

    public function updateClient($idClient){
        $ClientModel = new ClientModel();

        $data = [
            'arrayClients' => $ClientModel->find($idClient)
        ];
---
SELECT *
FROM `clients`
WHERE `clients`.`idClient` = '4'